%% 系统参数来源：Yue-Yue Tao IEEE TNSE
% 模态1
A1 = [0.5 -0.8;  0.4 -0.8];
B1 = [-0.2;  -0.2];
E1 = [0.1;  0.1];
C1 = [1 0.6;  1.2 -0.8];
D1 = [-0.1;  -0.2];
F1 = [0.1;  0.1];
% 模态2
A2 = [-1 0.8;  0.2 -1.2];
B2 = [0.2;  -0.3];
E2 = [0.1;  0.1];
C2 = [0 -1.2;  0.6 0.2];
D2 = [0.1;  -0.2];
F2 = [0.1;  0.1];
%% 系统转移概率矩阵
fiao = [0.9 0.1;  0.8 0.2];
%% 事件触发控制器转移概率矩阵
fiac = [0.6 0.4;  0.3 0.7]; % 异步 1.7834
% fiac = [1 0;  1 0]; % 模式无关 1.7852
% fiac = [1 0;  0 1]; % 同步 1.5396
% fiac = [0.6 0.4;  0 1]; % 部分异步 1.7203
%% 丢包率 Packet loss rate 1-k
k = 0.8;
hatk = sqrt(k*(1-k));
%% 事件触发阈值
etch = 0.3;  etcv = 0.3;  etc = blkdiag(etch, etcv);  
%% 病态求解法
delta = 0;
%% 系统模态/控制器模态
NumSysMode = 2; NumConMode = 2;